posts/2020/network-programming-reactor-and-proactor/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>网络编程中的Reactor和Proactor模式 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/blog/rss.xml">
<link href="/blog/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://samsonwang.github.io/blog/posts/2020/network-programming-reactor-and-proactor/">
<link rel="icon" href="/blog/favicon.ico" sizes="64x64">
<link rel="prev" href="/blog/posts/2020/debug-qt-ole-error/" title="Qt程序中OLE错误的调试记录" type="text/html">
<link rel="next" href="/blog/posts/2020/git-undo-last-local-commit/" title="在git中撤回最后一次本地提交" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="网络编程中的Reactor和Proactor模式">
<meta property="og:url" content="https://samsonwang.github.io/blog/posts/2020/network-programming-reactor-and-proactor/">
<meta property="og:description" content="本文介绍了两种常用的网络编程模式：Reactor模式和Proactor模式。这两种设计模式比较相似，它们的典型应用案例都是处理网络编程的并发请求，但是它们在具体的请求分派方式上又有区别。





Reactor模式简介


Reactor模式是一种事件驱动的设计模式，用于处理多输入源的并发服务请求。D.C.shmidt提出了Reactor模式，并在他的ACE框架中广泛使用了该设计模式。
服务处理">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-03-15T19:58:43+08:00">
<meta property="article:tag" content="design pattern">
<meta property="article:tag" content="network">
<meta property="article:tag" content="proactor">
<meta property="article:tag" content="reactor">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/blog/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/blog/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/blog/">Home</a>
            <a class="page-link" href="/blog/archive/">Archive</a>
            <a class="page-link" href="/blog/tags/">Tags</a>
            <a class="page-link" href="/blog/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">网络编程中的Reactor和Proactor模式</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2020-03-15T19:58:43+08:00" itemprop="datePublished">Mar 15, 2020</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
本文介绍了两种常用的网络编程模式：Reactor模式和Proactor模式。这两种设计模式比较相似，它们的典型应用案例都是处理网络编程的并发请求，但是它们在具体的请求分派方式上又有区别。<br></p>

<!-- TEASER_END -->

<div id="outline-container-org083d7de" class="outline-2">
<h2 id="org083d7de">Reactor模式简介</h2>
<div class="outline-text-2" id="text-org083d7de">
<p>
Reactor模式是一种事件驱动的设计模式，用于处理多输入源的并发服务请求。D.C.shmidt提出了Reactor模式，并在他的ACE框架中广泛使用了该设计模式。<br>
服务处理者（service handler）将接收到的服务请求同步地（synchronously）分发（demultiplex）给每个请求处理者（request handler）。<br>
在这里需要着重强调的一点是，在分发请求时是 <b>同步的</b> （synchronously）操作；与Reactor比较类似的另一种模式使用的是 <b>异步的</b> （asynchronously）操作，它的名字叫Proactor。<br></p>
</div>
</div>

<div id="outline-container-org6bc5a25" class="outline-2">
<h2 id="org6bc5a25">Reactor模式的优缺点</h2>
<div class="outline-text-2" id="text-org6bc5a25">
<p>
这一节通过剖析Reactor模式的优缺点，详细地介绍了Reactor模式的设计思想。其中，英文内容节选自 DC.Shmidt 的论文，中文内容为我的翻译和总结。<br></p>
</div>

<div id="outline-container-orgb3c810f" class="outline-3">
<h3 id="orgb3c810f">优点</h3>
<div class="outline-text-3" id="text-orgb3c810f">
<ul class="org-ul">
<li>关注点分离：将服务请求分发机制与具体的服务请求处理分离开，以实现代码的复用和解耦合。<br>
</li>
</ul>
<blockquote>
<p>
Separation of concerns: The Reactor pattern decouples application-independent demultiplexing and dispatching mechanisms from application-specific hook method functionality. The application-independent mechanisms become reusable components that know how to demultiplex events and dispatch the appropriate hook methods defined by Event Handlers. In contrast, the application-specific functionality in a hook method knows how to perform a particular type of service.<br></p>
</blockquote>

<ul class="org-ul">
<li>模块化、可重用性和可配置性：Reactor模式将应用程序功能分离为单独的类，这些拆分的类都具有单一职责。<br>
</li>
</ul>
<blockquote>
<p>
Improve modularity, reusability, and configurability of event-driven applications: The pattern decouples application functionality into separate classes. For instance, there are two separate classes in the logging server: one for establishing connections and another for receiving and processing logging records. This decoupling enables the reuse of the connection establishment class for different types of connection-oriented services (such as file transfer, remote login, and video-on-demand). Therefore, modifying or extending the functionality of the logging server only affects the implementation of the logging handler class.<br></p>
</blockquote>

<ul class="org-ul">
<li>提高可移植性：分发接口是可重用的，它能够适配不同平台的解复用（demultiplex）系统调用。<br>
</li>
</ul>
<blockquote>
<p>
Improves application portability: The Initiation Dispatcher’s interface can be reused independently of the OS system calls that perform event demultiplexing. These system calls detect and report the occurrence of one or more events that may occur simultaneously on multiple sources of events. Common sources of events may include I/O handles, timers, and synchronization objects. On UNIX platforms, the event demultiplexing system calls are called select and poll. In the Win32 API, the WaitForMultipleObjects system call performs event demultiplexing.<br></p>
</blockquote>

<ul class="org-ul">
<li>提供粗粒度的并发控制：在分发层的序列化通常能够消除比较复杂的并发同步。<br>
</li>
</ul>
<blockquote>
<p>
Provides coarse-grained concurrency control: The Reactor pattern serializes the invocation of event handlers at the level of event demultiplexing and dispatching within a process or thread. Serialization at the Initiation Dispatcher level often eliminates the need for more complicated synchronization or locking within an application process.<br></p>
</blockquote>
</div>
</div>

<div id="outline-container-orge0c0de7" class="outline-3">
<h3 id="orge0c0de7">缺点</h3>
<div class="outline-text-3" id="text-orge0c0de7">
<ul class="org-ul">
<li>有限的应用场景：Recator模式只有操作系统支持描述符（handle）时才最有效率。<br>
</li>
</ul>
<blockquote>
<p>
Restricted applicability: The Reactor pattern can only be applied efficiently if the OS supports Handles. It is possible to emulate the semantics of the Reactor pattern using multiple threads within the Initiation Dispatcher, e.g. one thread for each Handle. Whenever there are events available on a handle, its associated thread will read the event and place it on a queue that is processed sequentially by the initiation dispatcher. However, this design is typically very inefficient since it serializes all Event Handlers, thereby increasing synchronization and context switching overhead without enhancing parallelism.<br></p>
</blockquote>

<ul class="org-ul">
<li>事件处理是非独占的：事件处理器不能进行阻塞I/O，不适合耗时较长的操作。如传输较大文件时更适合Active Object模式。<br>
</li>
</ul>
<blockquote>
<p>
Non-preemptive: In a single-threaded application process, Event Handlers are not preempted while they are executing. This implies that an Event Handler should not perform blocking I/O on an individual Handle since this will block the entire process and impede the responsiveness for clients connected to other Handles. Therefore, for long-duration operations, such as transferring multimegabyte medical images, the Active Object pattern may be more effective. An Active Object uses multithreading or multi-processing to complete its tasks in parallel with the Initiation Dispatcher’s main event-loop.<br></p>
</blockquote>

<ul class="org-ul">
<li>难以调试：Reactor模式会打乱框架内部和事件处理接口的流程控制，这会导致程序难以单步调试。<br>
</li>
</ul>
<blockquote>
<p>
Hard to debug: Applications written with the Reactor pattern can be hard to debug since the inverted flow of control oscillates between the framework infrastructure and the method callbacks on application-specific handlers. This increases the difficulty of “single-stepping” through the runtime behavior of a framework within a debugger since application developers may not understand or have access to the framework code. This is similar to the problems encountered trying to debug a compiler lexical analyzer and parser written with LEX and YACC. In these applications, debugging is straightforward when the thread of control is within the user-defined action routines. Once the thread of control returns to the generated Deterministic Finite Automata (DFA) skeleton, however, it is hard to follow the program logic.<br></p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org035ce42" class="outline-2">
<h2 id="org035ce42">使用Reactor模式的网络通信库</h2>
<div class="outline-text-2" id="text-org035ce42">
<p>
libevent库的设计中就使用了Reactor模式，这个库的使用教程和示例代码在它的官方网站上很容易找到。libevent库解决了不同操作系统IO复用器有差别的问题，能够在具体的系统上选用最合适的系统接口，并为库的使用者抽象出了一套统一的应用接口。<br></p>
</div>
</div>

<div id="outline-container-orgf5679e9" class="outline-2">
<h2 id="orgf5679e9">Proactor模式简介</h2>
<div class="outline-text-2" id="text-orgf5679e9">
<p>
Proactor模式与Reactor模式相似，也是一种事件驱动的设计模式。与Reactor不同是，Proactor在分发请求时使用的是异步IO，所以需要为异步IO预先申请存储数据的缓存空间，并要指定异步IO完成是调用的回调函数。<br></p>
</div>
</div>

<div id="outline-container-orgcf89604" class="outline-2">
<h2 id="orgcf89604">Proactor模式的优缺点</h2>
<div class="outline-text-2" id="text-orgcf89604">
</div>
<div id="outline-container-orgea0e2d4" class="outline-3">
<h3 id="orgea0e2d4">优点</h3>
<div class="outline-text-3" id="text-orgea0e2d4">
<ul class="org-ul">
<li>关注点分离：这点与Reactor模式相同，事件分发框架提供事件调度的逻辑，具体的事件处理函数无需关注调度策略。<br>
</li>
<li>可移植性：与Reactor模式相同，通过抽象的事件调度框架能够适应不同操作系统的接口。<br>
</li>
<li>封装并发机制：异步接口允许在同一时刻有多个IO操作，各个IO操作之间不必互相等待。<br>
</li>
<li>并发策略与线程策略独立：异步IO是由操作系统完成的，在系统内核态执行，可以与用户态的线程函数有不同的并发策略。<br>
</li>
<li>提升性能：在处理耗时的操作时比Reactor有优势。<br>
</li>
<li>简化程序的同步机制：一部分同步操作由操作系统接管了。<br>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84cf78f" class="outline-3">
<h3 id="org84cf78f">缺点</h3>
<div class="outline-text-3" id="text-org84cf78f">
<ul class="org-ul">
<li>无法控制事件顺序：这也是异步操作的特性，每个IO操作都由操作系统完成，相互并行的，无法控制顺序。<br>
</li>
<li>性能依赖操作系统：需要操作系统提供高性能的异步操作接口。<br>
</li>
<li>调试不方便：这与Reactor模式相同，事件处理框架会接管函数的调用操作，不利于程序的单步调试。<br>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org793ca8f" class="outline-2">
<h2 id="org793ca8f">使用Proactor模式的网络通信库</h2>
<div class="outline-text-2" id="text-org793ca8f">
<p>
Boost库的ASIO使用的Proactor模式，它同时提供同步操作接口和异步操作接口。<br></p>
</div>
</div>

<div id="outline-container-orgdb68ebd" class="outline-2">
<h2 id="orgdb68ebd">参考资料</h2>
<div class="outline-text-2" id="text-orgdb68ebd">
<ul class="org-ul">
<li>
<a href="https://en.wikipedia.org/wiki/Reactor_pattern">wikipedia - reactor pattern</a><br>
</li>
<li>
<a href="http://www.cs.wustl.edu/~schmidt/PDF/reactor-siemens.pdf">wustl.edu - schmidt reactor</a><br>
</li>
<li>
<a href="https://stackoverflow.com/questions/9138294/what-is-the-difference-between-event-driven-model-and-reactor-pattern">stackoverflow.com - difference between event driven and reactor</a><br>
</li>
<li>
<a href="https://en.wikipedia.org/wiki/Proactor_pattern">wikipedia - proactor pattern</a><br>
</li>
<li>
<a href="https://www.boost.org/doc/libs/1_72_0/doc/html/boost_asio.html">boost.org - asio</a><br>
</li>
</ul>
</div>
</div>
  </div>
  
  <ul class="tags-list vertical-center">
<li>
      <a class="badge" href="/blog/tags/design-pattern/" rel="tag">design pattern</a>
    </li>
    <li>
      <a class="badge" href="/blog/tags/network/" rel="tag">network</a>
    </li>
    <li>
      <a class="badge" href="/blog/tags/proactor/" rel="tag">proactor</a>
    </li>
    <li>
      <a class="badge" href="/blog/tags/reactor/" rel="tag">reactor</a>
    </li>
  </ul></article><ul class="post-pager hidden-print">
<li class="previous">
      <a href="/blog/posts/2020/debug-qt-ole-error/" rel="prev">Previous post
        <br><span>Qt程序中OLE错误的调试记录</span>
      </a>
    </li>
    <li class="next">
      <a href="/blog/posts/2020/git-undo-last-local-commit/" rel="next">Next post
        <br><span>在git中撤回最后一次本地提交</span>
      </a>
    </li>
  </ul>
<section class="comments hidden-print"><div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="samsonwang-blog",
            disqus_url="https://samsonwang.github.io/blog/posts/2020/network-programming-reactor-and-proactor/",
        disqus_title="\u7f51\u7edc\u7f16\u7a0b\u4e2d\u7684Reactor\u548cProactor\u6a21\u5f0f",
        disqus_identifier="_cache/posts/2020/network-programming-reactor-and-proactor.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


  </section><script>var disqus_shortname="samsonwang-blog";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
  </main><footer class="site-footer h-card"><div class="wrapper">
      <div class="footer-col-wrapper">

        <div class="footer-col">
          <p class="site-desc">Personal handnote on software development</p>
        </div>

        <div class="footer-col">
          <div class="p-name">Samson Wang</div>
          <div class="copyright">Copyright 2025, all rights reserved.</div>
          <div class="social-links">
            <ul class="social-media-list">
<li><a rel="me" href="/blog/rss.xml">
                <svg class="svg-icon grey"><use href="/blog/assets/svg/social-icons.svg#rss"></use></svg></a></li>
              <li><a rel="nofollow" href="https://github.com/samsonwang">
                <svg class="svg-icon grey"><use href="/blog/assets/svg/social-icons.svg#github"></use></svg></a></li>
              <li><a rel="nofollow" href="https://twitter.com/samsonwangcn">
                <svg class="svg-icon grey"><use href="/blog/assets/svg/social-icons.svg#twitter"></use></svg></a></li>
              <li><a rel="nofollow" href="https://facebook.com/samsonwangcn">
                 <svg class="svg-icon grey"><use href="/blog/assets/svg/social-icons.svg#facebook"></use></svg></a></li>
            </ul>
</div>

        </div>

      </div>

    </div>

  </footer><div id="scroll-top" title="back to top">
  <div id="scroll-top-arrow"></div>
  <div id="scroll-top-stick"></div>
</div>


      <script src="/blog/assets/js/lazyload.min.js"></script><script src="/blog/assets/js/minima.min.js"></script><!-- google adsense --><script data-ad-client="ca-pub-6303134192857919" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><!-- Google Analytics - Global site tag (gtag.js) --><script async src="https://www.googletagmanager.com/gtag/js?id=UA-108507797-1"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());
  gtag('config', 'UA-108507797-1');
</script>
</body>
</html>
